Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
exit status 1: running "/Users/jlk/code/accurics/atlantis/local/terrascan-scan.sh" in "/Users/jlk/.atlantis/repos/jlk/tf-testing/2/default": 

```</details><summary>
Terrascan identified IAC policy violations.
</summary><details>```

Scan Results:
{
  "results": {
    "violations": [
      {
        "rule_name": "instanceWithNoVpc",
        "description": "Ensure that your AWS application is not deployed within the default Virtual Private Cloud in order to follow security best practices",
        "rule_id": "AC-AW-IS-IN-M-0144",
        "severity": "MEDIUM",
        "category": "Infrastructure Security",
        "resource_name": "alpine_mirror",
        "resource_type": "aws_instance",
        "file": "terrascan-812978764.tf",
        "line": 107
      },
      {
        "rule_name": "ec2UsingIMDSv1",
        "description": "EC2 instances should disable IMDS or require IMDSv2 as this can be related to the weaponization phase of kill chain",
        "rule_id": "AC-AWS-NS-IN-M-1172",
        "severity": "MEDIUM",
        "category": "Infrastructure Security",
        "resource_name": "alpine_mirror",
        "resource_type": "aws_instance",
        "file": "terrascan-812978764.tf",
        "line": 107
      },
      {
        "rule_name": "ebsSnapshotDisabled",
        "description": "Enable AWS EBS Snapshot Encryption",
        "rule_id": "AWS.EBS.EKM.Medium.0682",
        "severity": "HIGH",
        "category": "Data Protection",
        "resource_name": "jlk-alpine-rnd",
        "resource_type": "aws_ebs_volume",
        "file": "terrascan-812978764.tf",
        "line": 97
      }
    ],
    "skipped_violations": null,
    "scan_summary": {
      "file/folder": "/var/folders/s7/vk__7fhj4zj_dff_pf5fkfs80000gn/T/terrascan-812978764.tf",
      "iac_type": "terraform",
      "scanned_at": "2021-03-23 21:24:56.866281 +0000 UTC",
      "policies_validated": 158,
      "violated_policies": 3,
      "low": 0,
      "medium": 2,
      "high": 1
    }
  }
}

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/null from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/null v3.1.0
- Using previously-installed hashicorp/aws v3.33.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ebs_volume.jlk-alpine-rnd will be created
  + resource "aws_ebs_volume" "jlk-alpine-rnd" {
      + arn               = (known after apply)
      + availability_zone = "us-west-2a"
      + encrypted         = (known after apply)
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 150
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "jlk-alpine-rnd"
        }
      + throughput        = (known after apply)
      + type              = "gp2"
    }

  # aws_instance.alpine_mirror will be created
  + resource "aws_instance" "alpine_mirror" {
      + ami                          = "data.aws_ami.centos.id"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "m3.large"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "var.ssh_keypair_name"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = [
          + "aws_security_group.web_server.id",
        ]
      + source_dest_check            = true
      + subnet_id                    = "var.subnet_id"
      + tags                         = {
          + "Name" = "jlk-alpine-rnd"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = "gp2"
        }
    }

  # aws_security_group.web_server will be created
  + resource "aws_security_group" "web_server" {
      + arn                    = (known after apply)
      + description            = "Basic ACLs for webserver"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "http access"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ssh access"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "web_server"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "var.vpc_id"
    }

  # aws_volume_attachment.data_drive will be created
  + resource "aws_volume_attachment" "data_drive" {
      + device_name  = "/dev/sdd"
      + id           = (known after apply)
      + instance_id  = "aws_instance.alpine_mirror.id"
      + skip_destroy = true
      + volume_id    = "aws_ebs_volume.jlk-alpine-rnd.id"
    }

  # null_resource.example will be created
  + resource "null_resource" "example" {
      + id = (known after apply)
    }

  # null_resource.setup will be created
  + resource "null_resource" "setup" {
      + id       = (known after apply)
      + triggers = {
          + "volume_attachment" = "aws_volume_attachment.data_drive.id"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_ip_addr = (known after apply)

------------------------------------------------------------------------

This plan was saved to: /Users/jlk/.atlantis/repos/jlk/tf-testing/2/default/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/Users/jlk/.atlantis/repos/jlk/tf-testing/2/default/default.tfplan"


```
</details>

